import sys
sys.stdin = open('1_input.txt', 'r')
input = sys.stdin.readline

n = int(input())

dp = [0] * (n+1)
num_ = [i*i for i in range(1, 317)]


for i in range(1, n+1):
    s = []

    for j in num_:
        if j > i:
            break
        s.append(dp[i-j])

    dp[i] = min(s) + 1

print(dp[23])

# 0 - 0개
# 1 - 1^2 (1개)
# 2 - 1^2 + 1^2 (2개)
# 3 - 1^2 + 1^2 + 1^2 (3개)
# 4 - 2^2 (1개)
# 5 - 2^2 + 1^2 (2개)
# 6 - 2^2 + 1^2 + 1^2 (3개)
# 7 - 2^2 + 1^2 + 1^2 + 1^2 (4개)
# 8 - 2^2 + 2^2 (2개)
# 9 - 3^2 (1개)
# 10 - 3^2 + 1^2 (2개)
# 11 - 3^2 + 1^2 + 1^2 (3개)
# 12 - 2^2 + 2^2 + 2^2 (3개)
# 13 - 3^2 + 2^2 (2개)
# 14 - 3^2 + 2^2 + 1^2 (3개)
# 15 - 3^2 + 2^2 + 1^2 + 1^2 (4개)
# 16 - 4^2 (1개)
